group-reports/shahriar-1-2-tests/first-results/disk-throughput-tuning-protocol-A-sndbuf-2k/test-4.txt
write-randomly-test-job: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
write-randomly-test-job: Laying out IO file (1 file / 10240MiB)

write-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=29615: Sat Jul  8 11:28:52 2023
  write: IOPS=71, BW=573KiB/s (587kB/s)(337MiB/601177msec)
    slat (usec): min=5, max=2100.9k, avg=220185.11, stdev=443938.57
    clat (msec): min=50, max=9769, avg=3348.26, stdev=1461.87
     lat (msec): min=50, max=9803, avg=3568.44, stdev=1507.02
    clat percentiles (msec):
     |  1.00th=[  844],  5.00th=[ 1083], 10.00th=[ 1485], 20.00th=[ 2123],
     | 30.00th=[ 2400], 40.00th=[ 2836], 50.00th=[ 3205], 60.00th=[ 3608],
     | 70.00th=[ 4044], 80.00th=[ 4530], 90.00th=[ 5336], 95.00th=[ 6007],
     | 99.00th=[ 7215], 99.50th=[ 7752], 99.90th=[ 8490], 99.95th=[ 8926],
     | 99.99th=[ 9597]
   bw (  KiB/s): min=   14, max=  368, per=13.04%, avg=74.74, stdev=52.83, samples=9125
   iops        : min=    1, max=   46, avg= 9.04, stdev= 6.62, samples=9125
  lat (msec)   : 100=0.02%, 250=0.10%, 500=0.11%, 750=0.67%, 1000=1.79%
  cpu          : usr=0.01%, sys=0.03%, ctx=157962, majf=0, minf=136
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.3%, 16=99.4%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,43081,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=573KiB/s (587kB/s), 573KiB/s-573KiB/s (587kB/s-587kB/s), io=337MiB (353MB), run=601177-601177msec

Disk stats (read/write):
    drbd1: ios=0/43311, merge=0/0, ticks=0/56972147, in_queue=56972147, util=99.09%, aggrios=0/43528, aggrmerge=0/0, aggrticks=0/604842, aggrin_queue=604842, aggrutil=11.66%
    dm-0: ios=0/43528, merge=0/0, ticks=0/604842, in_queue=604842, util=11.66%, aggrios=0/43525, aggrmerge=0/3, aggrticks=0/605697, aggrin_queue=584008, aggrutil=11.65%
  vdb: ios=0/43525, merge=0/3, ticks=0/605697, in_queue=584008, util=11.65%